sdt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>sdt</title>
<!-- 2016-01-02 Sat 10:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Michael Wright" />
</head>
<body>
<div id="content">
<h1 class="title">sdt</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Simple Docker Tangle</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a></li>
<li><a href="#sec-1-2">1.2. Setup</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. set docker environement variables; create test data in to-be-shared directory</a></li>
<li><a href="#sec-1-2-2">1.2.2. test data created</a></li>
<li><a href="#sec-1-2-3">1.2.3. verify docker is working</a></li>
<li><a href="#sec-1-2-4">1.2.4. docker verification output</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Create a docker image</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Generate a simple Dockerfile (Ubuntu bash) in the build directory</a></li>
<li><a href="#sec-1-3-2">1.3.2. Build the docker image and tag it</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Run the created docker image</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Run a command that uses the shared data</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Simple Docker Tangle</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Create a shell session to set up docker environment.
Create directories to be shared with Docker
Tangle a Dockerfile
Use docker shell session to run docker build.
Use docker shell session to run a command in the built container.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Setup</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> set docker environement variables; create test data in to-be-shared directory</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh" id="setup">eval "$(docker-machine env default)"
mkdir build
mkdir shared
echo "elephant" &gt; shared/cairo.txt # place a known elephant in Cairo
ls -ltr shared
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> test data created</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
mkdir: build: File exists
mkdir: shared: File exists
mwright@SV-LT-1080:~/github/wrightmikea/simple-docker-tangle[master]$ total 8
-rw-r--r--  1 mwright  staff  9 Jan  2 08:51 cairo.txt
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> verify docker is working</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-sh" id="verify-docker">echo "show docker env"
env | grep DOC
docker run hello-world
echo "\n"
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> docker verification output</h4>
<div class="outline-text-4" id="text-1-2-4">
<pre class="example">
show docker env
DOCKER_HOST=tcp://192.168.99.100:2376
DOCKER_MACHINE_NAME=default
DOCKER_TLS_VERIFY=1
DOCKER_CERT_PATH=/Users/mwright/.docker/machine/machines/default
Hello from Docker.
This message shows that your installation appears to be working correctly.

To generate this message, Docker took the following steps:
 1. The Docker client contacted the Docker daemon.
 2. The Docker daemon pulled the "hello-world" image from the Docker Hub.
 3. The Docker daemon created a new container from that image which runs the
    executable that produces the output you are currently reading.
 4. The Docker daemon streamed that output to the Docker client, which sent it
    to your terminal.

To try something more ambitious, you can run an Ubuntu container with:
docker run -it ubuntu bash

Share images, automate workflows, and more with a free Docker Hub account:
 https://hub.docker.com

For more examples and ideas, visit:
 https://docs.docker.com/userguide/
\n
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Create a docker image</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Generate a simple Dockerfile (Ubuntu bash) in the build directory</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-dockerfile" id="generate-dockerfile">FROM ubuntu
CMD bash
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Build the docker image and tag it</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-sh" id="build-image">cat build/Dockerfile
echo "---"
docker build -t dockertangle build
</pre>
</div>
<p>
produces:
</p>
<pre class="example">
FROM ubuntu
CMD bash
---
Sending build context to Docker daemon 2.048 kBSending build context to Docker daemon 2.048 kB
Step 1 : FROM ubuntu
89d5d8e8bafb
Step 2 : CMD bash
Using cache
e09d070f829f
Successfully built e09d070f829f
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Run the created docker image</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Run a command that uses the shared data</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-sh" id="run-image">echo "PWD=${PWD}"
echo "ls shared=$(ls shared)"
#ls -ltr "${PWD}/shared"
docker run -it -v ${PWD}/shared:/opt/shared dockertangle find /opt/shared -name "*.txt" -exec grep elephant {} \; -print
</pre>
</div>
<p>
produces:
</p>
<pre class="example">
PWD=/Users/mwright/github/wrightmikea/simple-docker-tangle
ls shared=cairo.txt
mwright@SV-LT-1080:~/github/wrightmikea/simple-docker-tangle[master]$ elephant
/opt/shared/cairo.txt
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Wright</p>
<p class="date">Created: 2016-01-02 Sat 10:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
